app/controllers/chores_controller.rb

  def add_chore
    household = Household.find_by(id: params[:household])
    name = params[:name]
    location = params[:location]
    est_time = params[:est_time]
    frequency = params[:frequency]
    user = params[:user]

    # Validate all fields have been filled in
    if name == '' || location == '' || est_time == '' || frequency == '' || user == ''
      render json: {result: 'ERROR', message: 'Please ensure all fields have been filled in.'}
      return
    end

    #Auto assign chores based on who has the least
    if user == 'Auto Assign'
      #Loop through each member of the household and find who has the least amount of time spent on chores.
      users_time = {}
      household.users.each do |u|
        time = 0
        u.chores.each do |chore|
          time += chore.est_time
        end
        users_time[u.id] = time
      end
      sucker = users_time.sort_by{|k,v| v}.first
      user = sucker[0]
    end

    Chore.create(
      name: name,
      location: location,
      est_time: est_time.to_i,
      frequency: frequency.to_i,
      user_id: user,
      completed: false,
      household_id: household.id
    )
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "households_users" ON "users"."id" = "households_users"."user_id" WHERE "households_users"."household_id" = $1  [["household_id", 13]]
INSERT INTO "chores" ("name", "location", "est_time", "user_id", "household_id", "created_at", "updated_at", "frequency", "completed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def delete
    chores = params[:chores]

    chores.each do |chore|
      Chore.find_by(id: chore).destroy
---
DELETE FROM "chores" WHERE "chores"."id" = $1  [["id", 9]]
SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def complete
    chores = params[:chores]

    chores.each do |chore|
      Chore.find_by(id: chore).update(completed: true)
---
SELECT  "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "chores" SET "completed" = $1, "updated_at" = $2 WHERE "chores"."id" = $3  [["completed", true], ["updated_at", "2020-09-24 00:39:27.573528"], ["id", 12]]