app/controllers/households_controller.rb

  def details
    h = Household.find_by(id: params[:id])
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def add_member
    household = Household.find_by(id: params[:household])
    added_member = User.find_by(email: params[:email])

    #Validate that the current user ownes the household they're adding a member to
    if household.owner != current_user.id
      render json: {result: 'ERROR', message: 'You must be the owner of this household to add members'}
      return
    end

    #validate that the input email exists
    if added_member == nil
      render json: {result: 'ERROR', message: 'There is no account associated with this email'}
      return
    end

    if household.users.include?(added_member)
---
SELECT  "households".* FROM "households" WHERE "households"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jwinger@ga.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "households_users" ON "users"."id" = "households_users"."user_id" WHERE "households_users"."household_id" = $1  [["household_id", 13]]
SELECT  1 AS one FROM "users" INNER JOIN "households_users" ON "users"."id" = "households_users"."user_id" WHERE "households_users"."household_id" = $1 AND "users"."id" = $2 LIMIT $3  [["household_id", 13], ["id", 22], ["LIMIT", 1]]